## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_dashboard.service_dashboard[0] will be updated in-place
  ~ resource "datadog_dashboard" "service_dashboard" {
        id                      = "4jj-dh7-k8z"
        tags                    = []
        # (9 unchanged attributes hidden)

      ~ template_variable {
-           default          = "production" -> null
          ~ defaults         = [
+               "production",
            ]
            name             = "env"
            # (2 unchanged attributes hidden)
        }
      ~ template_variable {
-           default          = "grants-ingest" -> null
          ~ defaults         = [
+               "grants-ingest",
            ]
            name             = "service"
            # (2 unchanged attributes hidden)
        }
      ~ template_variable {
-           default          = "*" -> null
          ~ defaults         = [
+               "*",
            ]
            name             = "version"
            # (2 unchanged attributes hidden)
        }

      ~ widget {
            id = 7855711065432377

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 749606716933144

-                   manage_status_definition {
-                       color_preference    = "text" -> null
-                       display_format      = "countsAndList" -> null
-                       hide_zero_counts    = true -> null
-                       query               = "tag:($env AND $service)" -> null
-                       show_last_triggered = true -> null
-                       show_priority       = false -> null
-                       sort                = "status,asc" -> null
-                       title               = "Monitors" -> null
                    }

+                   trace_service_definition {
+                       display_format     = "two_column"
+                       env                = "$env"
+                       service            = "$service"
+                       show_breakdown     = false
+                       show_distribution  = false
+                       show_errors        = true
+                       show_hits          = true
+                       show_latency       = false
+                       show_resource_list = true
+                       size_format        = "large"
+                       span_name          = "aws.lambda"
+                       title              = "Overview"
                    }

                  ~ widget_layout {
                      ~ height          = 6 -> 9
                      ~ width           = 4 -> 8
                      ~ x               = 8 -> 0
                        # (2 unchanged attributes hidden)
                    }
                }
              ~ widget {
                    id = 4065408682871487

+                   manage_status_definition {
+                       color_preference    = "text"
+                       display_format      = "countsAndList"
+                       hide_zero_counts    = true
+                       query               = "tag:($env AND $service)"
+                       show_last_triggered = true
+                       show_priority       = false
+                       sort                = "status,asc"
+                       title               = "Monitors"
                    }

-                   trace_service_definition {
-                       display_format     = "two_column" -> null
-                       env                = "$env" -> null
-                       service            = "$service" -> null
-                       show_breakdown     = false -> null
-                       show_distribution  = false -> null
-                       show_errors        = true -> null
-                       show_hits          = true -> null
-                       show_latency       = false -> null
-                       show_resource_list = true -> null
-                       size_format        = "large" -> null
-                       span_name          = "aws.lambda" -> null
-                       title              = "Overview" -> null
                    }

                  ~ widget_layout {
                      ~ height          = 9 -> 6
                      ~ width           = 8 -> 4
                      ~ x               = 0 -> 8
                      ~ y               = 6 -> 0
                        # (1 unchanged attribute hidden)
                    }
                }

                # (1 unchanged block hidden)
            }

          ~ widget_layout {
              ~ height          = 16 -> 9
                # (4 unchanged attributes hidden)
            }
        }
      ~ widget {
            id = 8019728238649985

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 16 -> 9
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 7467334510440160

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 20 -> 12
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 6555201042248280

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 24 -> 15
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 3283289201471194

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 28 -> 18
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 3937076759814513

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 32 -> 21
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 7417728478723464

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 36 -> 24
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 611807701797813

          ~ widget_layout {
              ~ height          = 7 -> 6
              ~ y               = 40 -> 27
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 2884605716927919

          ~ widget_layout {
              ~ height          = 14 -> 13
              ~ y               = 47 -> 33
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 7863168989919544

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 61 -> 46
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 1837276699713400

          ~ widget_layout {
              ~ height          = 7 -> 6
              ~ y               = 65 -> 49
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 4199027587422654

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 72 -> 55
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-357150818708-us-west-2/9705bcf29c2ffa5e91f0a59024a08632.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "8c3d740c6f63c338752d2f5387104208-3" -> (known after apply)
      ~ id                     = "9705bcf29c2ffa5e91f0a59024a08632.zip" -> (known after apply)
      ~ key                    = "9705bcf29c2ffa5e91f0a59024a08632.zip" -> "86cd89e3ad14be401f96489aec4c04d8.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "drp5MM03JDwJvkDj5NO7aLddF4lwft0t" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2024-04-29T22:15:38.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:51" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:51/invocations" -> (known after apply)
      ~ s3_key                         = "9705bcf29c2ffa5e91f0a59024a08632.zip" -> "86cd89e3ad14be401f96489aec4c04d8.zip"
        tags                           = {}
      ~ version                        = "51" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:eeab0e1c1bd413d77a11744bca9a3a47c60f4a55,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:a73fabf29d01f6ab552ad304facb95c42ccde363,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "eeab0e1c1bd413d77a11744bca9a3a47c60f4a55" -> "a73fabf29d01f6ab552ad304facb95c42ccde363"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "51" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-357150818708-us-west-2/cf9a25ef4f6df59275b0b0dc584a465e.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "312dc084d62fbc136097bafd148af83c-3" -> (known after apply)
      ~ id                     = "cf9a25ef4f6df59275b0b0dc584a465e.zip" -> (known after apply)
      ~ key                    = "cf9a25ef4f6df59275b0b0dc584a465e.zip" -> "09129f432b4da3de0aa867ed15791b41.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "k1k1Fa.PjEG9PsMfOnDxSEHmskoyy26n" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadGrantsGovDB"
      ~ last_modified                  = "2024-04-29T22:15:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:51" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:51/invocations" -> (known after apply)
      ~ s3_key                         = "cf9a25ef4f6df59275b0b0dc584a465e.zip" -> "09129f432b4da3de0aa867ed15791b41.zip"
        tags                           = {}
      ~ version                        = "51" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:eeab0e1c1bd413d77a11744bca9a3a47c60f4a55,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:a73fabf29d01f6ab552ad304facb95c42ccde363,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "eeab0e1c1bd413d77a11744bca9a3a47c60f4a55" -> "a73fabf29d01f6ab552ad304facb95c42ccde363"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "51" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-357150818708-us-west-2/91fe57ecf3e42aff5caadd909b7fe20e.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6806b8fb9788f97d1eb8792a1294c532-3" -> (known after apply)
      ~ id                     = "91fe57ecf3e42aff5caadd909b7fe20e.zip" -> (known after apply)
      ~ key                    = "91fe57ecf3e42aff5caadd909b7fe20e.zip" -> "4016132c658d78e6f51742300557a63d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = ".zlFEssMIPcsjHSjX_fCIj7YPOhjiwPK" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-EnqueueFFISDownload"
      ~ last_modified                  = "2024-04-29T22:15:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:51" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:51/invocations" -> (known after apply)
      ~ s3_key                         = "91fe57ecf3e42aff5caadd909b7fe20e.zip" -> "4016132c658d78e6f51742300557a63d.zip"
        tags                           = {}
      ~ version                        = "51" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:eeab0e1c1bd413d77a11744bca9a3a47c60f4a55,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:a73fabf29d01f6ab552ad304facb95c42ccde363,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "eeab0e1c1bd413d77a11744bca9a3a47c60f4a55" -> "a73fabf29d01f6ab552ad304facb95c42ccde363"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "51" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-357150818708-us-west-2/8835deb1e567fc848ad341fc9f7fda04.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "9e0bd17db29903095df5bde5fbaaf277-3" -> (known after apply)
      ~ id                     = "8835deb1e567fc848ad341fc9f7fda04.zip" -> (known after apply)
      ~ key                    = "8835deb1e567fc848ad341fc9f7fda04.zip" -> "2147f05911e5ee3d0146baa6e466a476.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "tpcii8F0eFL4RxhBOwyBlOfg3XCzotRq" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2024-04-29T22:15:38.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:51" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:51/invocations" -> (known after apply)
      ~ s3_key                         = "8835deb1e567fc848ad341fc9f7fda04.zip" -> "2147f05911e5ee3d0146baa6e466a476.zip"
        tags                           = {}
      ~ version                        = "51" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:eeab0e1c1bd413d77a11744bca9a3a47c60f4a55,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:a73fabf29d01f6ab552ad304facb95c42ccde363,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "eeab0e1c1bd413d77a11744bca9a3a47c60f4a55" -> "a73fabf29d01f6ab552ad304facb95c42ccde363"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "51" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-357150818708-us-west-2/7c0c415ba30f3e9f5b3926719d93c386.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "fc207f93fe4f88aad03ed2575b6ec314-3" -> (known after apply)
      ~ id                     = "7c0c415ba30f3e9f5b3926719d93c386.zip" -> (known after apply)
      ~ key                    = "7c0c415ba30f3e9f5b3926719d93c386.zip" -> "134974c360235174f37f9293b35ab1b2.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "KjHB8yIpPmGI.K.Bl.sRuMtXBruGQ9CN" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistFFISData"
      ~ last_modified                  = "2024-04-29T22:15:36.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:51" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:51/invocations" -> (known after apply)
      ~ s3_key                         = "7c0c415ba30f3e9f5b3926719d93c386.zip" -> "134974c360235174f37f9293b35ab1b2.zip"
        tags                           = {}
      ~ version                        = "51" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:eeab0e1c1bd413d77a11744bca9a3a47c60f4a55,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:a73fabf29d01f6ab552ad304facb95c42ccde363,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "eeab0e1c1bd413d77a11744bca9a3a47c60f4a55" -> "a73fabf29d01f6ab552ad304facb95c42ccde363"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "51" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-357150818708-us-west-2/442842a3e1adde7b59905326eb4c47a4.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "59fccab9c1c3ef265c2a7ed6828427f6-3" -> (known after apply)
      ~ id                     = "442842a3e1adde7b59905326eb4c47a4.zip" -> (known after apply)
      ~ key                    = "442842a3e1adde7b59905326eb4c47a4.zip" -> "dbca14460c433327fa68687adeb75c2e.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "BnOfLwt04NtzVyHw_RgZZR7T17oK7kwG" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2024-04-29T22:15:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistGrantsGovXMLDB:51" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistGrantsGovXMLDB:51/invocations" -> (known after apply)
      ~ s3_key                         = "442842a3e1adde7b59905326eb4c47a4.zip" -> "dbca14460c433327fa68687adeb75c2e.zip"
        tags                           = {}
      ~ version                        = "51" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:eeab0e1c1bd413d77a11744bca9a3a47c60f4a55,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:a73fabf29d01f6ab552ad304facb95c42ccde363,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "eeab0e1c1bd413d77a11744bca9a3a47c60f4a55" -> "a73fabf29d01f6ab552ad304facb95c42ccde363"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "51" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-357150818708-us-west-2/927e936be53df26b8f9da90619c6c025.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "599372b49b85900e8bd65f9c85b19250-3" -> (known after apply)
      ~ id                     = "927e936be53df26b8f9da90619c6c025.zip" -> (known after apply)
      ~ key                    = "927e936be53df26b8f9da90619c6c025.zip" -> "4aba9b3270b1ef079efa07f80e0079e1.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "Mt.4994dT_t2odvmsc.Kl1Fbx6x.cycZ" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PublishGrantEvents"
      ~ last_modified                  = "2024-04-29T22:15:38.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PublishGrantEvents:52" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PublishGrantEvents:52/invocations" -> (known after apply)
      ~ s3_key                         = "927e936be53df26b8f9da90619c6c025.zip" -> "4aba9b3270b1ef079efa07f80e0079e1.zip"
        tags                           = {}
      ~ version                        = "52" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:eeab0e1c1bd413d77a11744bca9a3a47c60f4a55,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents" -> "git.commit.sha:a73fabf29d01f6ab552ad304facb95c42ccde363,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents"
              ~ "DD_VERSION"                   = "eeab0e1c1bd413d77a11744bca9a3a47c60f4a55" -> "a73fabf29d01f6ab552ad304facb95c42ccde363"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.current_version_triggers["dynamodb"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "dynamodb" -> (known after apply)
      ~ qualifier           = "52" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-357150818708-us-west-2/c1f1afb3ab5b56c613f132d8eefbdc55.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "99d81627d32d923399e1a9fc279ae57a-3" -> (known after apply)
      ~ id                     = "c1f1afb3ab5b56c613f132d8eefbdc55.zip" -> (known after apply)
      ~ key                    = "c1f1afb3ab5b56c613f132d8eefbdc55.zip" -> "f4f7aead0f2304abb03895008418b4bc.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "c_IqH0MBGUx.7IgvoNqb8MS_5Sadw_sd" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ReceiveFFISEmail"
      ~ last_modified                  = "2024-04-29T22:15:36.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ReceiveFFISEmail:50" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ReceiveFFISEmail:50/invocations" -> (known after apply)
      ~ s3_key                         = "c1f1afb3ab5b56c613f132d8eefbdc55.zip" -> "f4f7aead0f2304abb03895008418b4bc.zip"
        tags                           = {}
      ~ version                        = "50" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:eeab0e1c1bd413d77a11744bca9a3a47c60f4a55,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail" -> "git.commit.sha:a73fabf29d01f6ab552ad304facb95c42ccde363,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail"
              ~ "DD_VERSION"                     = "eeab0e1c1bd413d77a11744bca9a3a47c60f4a55" -> "a73fabf29d01f6ab552ad304facb95c42ccde363"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "50" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-357150818708-us-west-2/1293e4f9728400db457382de1dd5f249.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "5ed11f41543eba1d46f8a986aaf0b36b-3" -> (known after apply)
      ~ id                     = "1293e4f9728400db457382de1dd5f249.zip" -> (known after apply)
      ~ key                    = "1293e4f9728400db457382de1dd5f249.zip" -> "2527ecf33d836dac586caaf4bd7fcddd.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "R37pbQxwV_Gy7x5YmBN5mkOTHaPok2JG" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitFFISSpreadsheet"
      ~ last_modified                  = "2024-04-29T22:15:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitFFISSpreadsheet:51" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitFFISSpreadsheet:51/invocations" -> (known after apply)
      ~ s3_key                         = "1293e4f9728400db457382de1dd5f249.zip" -> "2527ecf33d836dac586caaf4bd7fcddd.zip"
        tags                           = {}
      ~ version                        = "51" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:eeab0e1c1bd413d77a11744bca9a3a47c60f4a55,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:a73fabf29d01f6ab552ad304facb95c42ccde363,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "eeab0e1c1bd413d77a11744bca9a3a47c60f4a55" -> "a73fabf29d01f6ab552ad304facb95c42ccde363"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "51" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-357150818708-us-west-2/edd9b59f86475a65abb504e5e2fedbf0.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "7ef29552239ade0c8030d068093bbb5e-3" -> (known after apply)
      ~ id                     = "edd9b59f86475a65abb504e5e2fedbf0.zip" -> (known after apply)
      ~ key                    = "edd9b59f86475a65abb504e5e2fedbf0.zip" -> "9605e8691ef1044c8999a807428e51a2.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "kDMFhCrSbP77Mau.zqeH_PPvn64rKcKz" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2024-04-29T22:15:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitGrantsGovXMLDB:51" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitGrantsGovXMLDB:51/invocations" -> (known after apply)
      ~ s3_key                         = "edd9b59f86475a65abb504e5e2fedbf0.zip" -> "9605e8691ef1044c8999a807428e51a2.zip"
        tags                           = {}
      ~ version                        = "51" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:eeab0e1c1bd413d77a11744bca9a3a47c60f4a55,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:a73fabf29d01f6ab552ad304facb95c42ccde363,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "eeab0e1c1bd413d77a11744bca9a3a47c60f4a55" -> "a73fabf29d01f6ab552ad304facb95c42ccde363"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "51" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 20 to add, 11 to change, 20 to destroy.
```

</details>

*Pusher: @dependabot[bot], Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/9011655727)*